{"class_name": "Model", "config": {"name": "model_3", "layers": [{"name": "b1_zp1_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 128, 43], "dtype": "float32", "sparse": false, "name": "b1_zp1_input"}, "inbound_nodes": []}, {"name": "b1_zp1", "class_name": "ZeroPadding2D", "config": {"name": "b1_zp1", "trainable": false, "batch_input_shape": [null, 1, 128, 43], "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["b1_zp1_input", 0, 0, {}]]]}, {"name": "b1_c1", "class_name": "Conv2D", "config": {"name": "b1_c1", "trainable": false, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b1_zp1", 0, 0, {}]]]}, {"name": "b1_a1", "class_name": "Activation", "config": {"name": "b1_a1", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["b1_c1", 0, 0, {}]]]}, {"name": "b1_zp2", "class_name": "ZeroPadding2D", "config": {"name": "b1_zp2", "trainable": false, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["b1_a1", 0, 0, {}]]]}, {"name": "b1_c2", "class_name": "Conv2D", "config": {"name": "b1_c2", "trainable": false, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b1_zp2", 0, 0, {}]]]}, {"name": "b1_a2", "class_name": "Activation", "config": {"name": "b1_a2", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["b1_c2", 0, 0, {}]]]}, {"name": "b1_mp1", "class_name": "MaxPooling2D", "config": {"name": "b1_mp1", "trainable": false, "pool_size": [3, 3], "padding": "valid", "strides": [3, 3], "data_format": "channels_first"}, "inbound_nodes": [[["b1_a2", 0, 0, {}]]]}, {"name": "b1_d1", "class_name": "Dropout", "config": {"name": "b1_d1", "trainable": false, "rate": 0.25}, "inbound_nodes": [[["b1_mp1", 0, 0, {}]]]}, {"name": "b2_zp1", "class_name": "ZeroPadding2D", "config": {"name": "b2_zp1", "trainable": false, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["b1_d1", 0, 0, {}]]]}, {"name": "b2_c1", "class_name": "Conv2D", "config": {"name": "b2_c1", "trainable": false, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b2_zp1", 0, 0, {}]]]}, {"name": "b2_a1", "class_name": "Activation", "config": {"name": "b2_a1", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["b2_c1", 0, 0, {}]]]}, {"name": "b2_zp2", "class_name": "ZeroPadding2D", "config": {"name": "b2_zp2", "trainable": false, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["b2_a1", 0, 0, {}]]]}, {"name": "b2_c2", "class_name": "Conv2D", "config": {"name": "b2_c2", "trainable": false, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b2_zp2", 0, 0, {}]]]}, {"name": "b2_a2", "class_name": "Activation", "config": {"name": "b2_a2", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["b2_c2", 0, 0, {}]]]}, {"name": "b2_mp1", "class_name": "MaxPooling2D", "config": {"name": "b2_mp1", "trainable": false, "pool_size": [3, 3], "padding": "valid", "strides": [3, 3], "data_format": "channels_first"}, "inbound_nodes": [[["b2_a2", 0, 0, {}]]]}, {"name": "b2_d1", "class_name": "Dropout", "config": {"name": "b2_d1", "trainable": false, "rate": 0.25}, "inbound_nodes": [[["b2_mp1", 0, 0, {}]]]}, {"name": "b3_zp1", "class_name": "ZeroPadding2D", "config": {"name": "b3_zp1", "trainable": false, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["b2_d1", 0, 0, {}]]]}, {"name": "b3_c1", "class_name": "Conv2D", "config": {"name": "b3_c1", "trainable": false, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b3_zp1", 0, 0, {}]]]}, {"name": "b3_a1", "class_name": "Activation", "config": {"name": "b3_a1", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["b3_c1", 0, 0, {}]]]}, {"name": "b3_zp2", "class_name": "ZeroPadding2D", "config": {"name": "b3_zp2", "trainable": false, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["b3_a1", 0, 0, {}]]]}, {"name": "b3_c2", "class_name": "Conv2D", "config": {"name": "b3_c2", "trainable": false, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b3_zp2", 0, 0, {}]]]}, {"name": "b3_a2", "class_name": "Activation", "config": {"name": "b3_a2", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["b3_c2", 0, 0, {}]]]}, {"name": "b3_mp1", "class_name": "MaxPooling2D", "config": {"name": "b3_mp1", "trainable": false, "pool_size": [3, 3], "padding": "valid", "strides": [3, 3], "data_format": "channels_first"}, "inbound_nodes": [[["b3_a2", 0, 0, {}]]]}, {"name": "b3_d1", "class_name": "Dropout", "config": {"name": "b3_d1", "trainable": false, "rate": 0.25}, "inbound_nodes": [[["b3_mp1", 0, 0, {}]]]}, {"name": "b4_zp1", "class_name": "ZeroPadding2D", "config": {"name": "b4_zp1", "trainable": false, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["b3_d1", 0, 0, {}]]]}, {"name": "b4_c1", "class_name": "Conv2D", "config": {"name": "b4_c1", "trainable": false, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b4_zp1", 0, 0, {}]]]}, {"name": "b4_a1", "class_name": "Activation", "config": {"name": "b4_a1", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["b4_c1", 0, 0, {}]]]}, {"name": "b4_zp4", "class_name": "ZeroPadding2D", "config": {"name": "b4_zp4", "trainable": false, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["b4_a1", 0, 0, {}]]]}, {"name": "b4_c2", "class_name": "Conv2D", "config": {"name": "b4_c2", "trainable": false, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b4_zp4", 0, 0, {}]]]}, {"name": "b4_a2", "class_name": "Activation", "config": {"name": "b4_a2", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["b4_c2", 0, 0, {}]]]}, {"name": "b4_gmp1", "class_name": "GlobalMaxPooling2D", "config": {"name": "b4_gmp1", "trainable": false, "data_format": "channels_first"}, "inbound_nodes": [[["b4_a2", 0, 0, {}]]]}, {"name": "b5_fc1", "class_name": "Dense", "config": {"name": "b5_fc1", "trainable": false, "units": 1024, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b4_gmp1", 0, 0, {}]]]}, {"name": "b5_a1", "class_name": "Activation", "config": {"name": "b5_a1", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["b5_fc1", 0, 0, {}]]]}, {"name": "b5_d1", "class_name": "Dropout", "config": {"name": "b5_d1", "trainable": true, "rate": 0.5}, "inbound_nodes": [[["b5_a1", 0, 0, {}]]]}, {"name": "dense_3", "class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "units": 6, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b5_d1", 0, 0, {}]]]}], "input_layers": [["b1_zp1_input", 0, 0]], "output_layers": [["dense_3", 0, 0]]}, "keras_version": "2.0.8", "backend": "tensorflow"}